# DeselectEditText

## Description
Deselects all text in the specified edit control.

```pascal
PROCEDURE DeselectEditText(
				dialogID  : LONGINT;
				controlID : LONGINT);
```

```python
def vs.DeselectEditText(dialogID, controlID):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT|   |
|controlID|LONGINT|   |

## Version
Availability: from VectorWorks12.0.1

## Category
* Dialogs - Modern